RIOT-OS/RIOT/cpu/StellarisWare/inc/lm3s5g51.h
//*****************************************************************************
//
// Univeral Serial Bus registers (USB0)
//
//*****************************************************************************
#define USB0_FADDR_R            (*((volatile unsigned char *)0x40050000))
#define USB0_POWER_R            (*((volatile unsigned char *)0x40050001))
#define USB0_TXIS_R             (*((volatile unsigned short *)0x40050002))
#define USB0_RXIS_R             (*((volatile unsigned short *)0x40050004))
#define USB0_TXIE_R             (*((volatile unsigned short *)0x40050006))
#define USB0_RXIE_R             (*((volatile unsigned short *)0x40050008))
#define USB0_IS_R               (*((volatile unsigned char *)0x4005000A))
#define USB0_IE_R               (*((volatile unsigned char *)0x4005000B))
#define USB0_FRAME_R            (*((volatile unsigned short *)0x4005000C))
#define USB0_EPIDX_R            (*((volatile unsigned char *)0x4005000E))
#define USB0_TEST_R             (*((volatile unsigned char *)0x4005000F))
#define USB0_FIFO0_R            (*((volatile unsigned long *)0x40050020))
#define USB0_FIFO1_R            (*((volatile unsigned long *)0x40050024))
#define USB0_FIFO2_R            (*((volatile unsigned long *)0x40050028))
#define USB0_FIFO3_R            (*((volatile unsigned long *)0x4005002C))
#define USB0_FIFO4_R            (*((volatile unsigned long *)0x40050030))
#define USB0_FIFO5_R            (*((volatile unsigned long *)0x40050034))
#define USB0_FIFO6_R            (*((volatile unsigned long *)0x40050038))
#define USB0_FIFO7_R            (*((volatile unsigned long *)0x4005003C))
#define USB0_FIFO8_R            (*((volatile unsigned long *)0x40050040))
#define USB0_FIFO9_R            (*((volatile unsigned long *)0x40050044))
#define USB0_FIFO10_R           (*((volatile unsigned long *)0x40050048))
#define USB0_FIFO11_R           (*((volatile unsigned long *)0x4005004C))
#define USB0_FIFO12_R           (*((volatile unsigned long *)0x40050050))
#define USB0_FIFO13_R           (*((volatile unsigned long *)0x40050054))
#define USB0_FIFO14_R           (*((volatile unsigned long *)0x40050058))
#define USB0_FIFO15_R           (*((volatile unsigned long *)0x4005005C))
#define USB0_DEVCTL_R           (*((volatile unsigned char *)0x40050060))
#define USB0_TXFIFOSZ_R         (*((volatile unsigned char *)0x40050062))
#define USB0_RXFIFOSZ_R         (*((volatile unsigned char *)0x40050063))
#define USB0_TXFIFOADD_R        (*((volatile unsigned short *)0x40050064))
#define USB0_RXFIFOADD_R        (*((volatile unsigned short *)0x40050066))
#define USB0_CONTIM_R           (*((volatile unsigned char *)0x4005007A))
#define USB0_VPLEN_R            (*((volatile unsigned char *)0x4005007B))
#define USB0_FSEOF_R            (*((volatile unsigned char *)0x4005007D))
#define USB0_LSEOF_R            (*((volatile unsigned char *)0x4005007E))
#define USB0_TXFUNCADDR0_R      (*((volatile unsigned char *)0x40050080))
#define USB0_TXHUBADDR0_R       (*((volatile unsigned char *)0x40050082))
#define USB0_TXHUBPORT0_R       (*((volatile unsigned char *)0x40050083))
#define USB0_TXFUNCADDR1_R      (*((volatile unsigned char *)0x40050088))
#define USB0_TXHUBADDR1_R       (*((volatile unsigned char *)0x4005008A))
#define USB0_TXHUBPORT1_R       (*((volatile unsigned char *)0x4005008B))
#define USB0_RXFUNCADDR1_R      (*((volatile unsigned char *)0x4005008C))
#define USB0_RXHUBADDR1_R       (*((volatile unsigned char *)0x4005008E))
#define USB0_RXHUBPORT1_R       (*((volatile unsigned char *)0x4005008F))
#define USB0_TXFUNCADDR2_R      (*((volatile unsigned char *)0x40050090))
#define USB0_TXHUBADDR2_R       (*((volatile unsigned char *)0x40050092))
#define USB0_TXHUBPORT2_R       (*((volatile unsigned char *)0x40050093))
#define USB0_RXFUNCADDR2_R      (*((volatile unsigned char *)0x40050094))
#define USB0_RXHUBADDR2_R       (*((volatile unsigned char *)0x40050096))
#define USB0_RXHUBPORT2_R       (*((volatile unsigned char *)0x40050097))
#define USB0_TXFUNCADDR3_R      (*((volatile unsigned char *)0x40050098))
#define USB0_TXHUBADDR3_R       (*((volatile unsigned char *)0x4005009A))
#define USB0_TXHUBPORT3_R       (*((volatile unsigned char *)0x4005009B))
#define USB0_RXFUNCADDR3_R      (*((volatile unsigned char *)0x4005009C))
#define USB0_RXHUBADDR3_R       (*((volatile unsigned char *)0x4005009E))
#define USB0_RXHUBPORT3_R       (*((volatile unsigned char *)0x4005009F))
#define USB0_TXFUNCADDR4_R      (*((volatile unsigned char *)0x400500A0))
#define USB0_TXHUBADDR4_R       (*((volatile unsigned char *)0x400500A2))
#define USB0_TXHUBPORT4_R       (*((volatile unsigned char *)0x400500A3))
#define USB0_RXFUNCADDR4_R      (*((volatile unsigned char *)0x400500A4))
#define USB0_RXHUBADDR4_R       (*((volatile unsigned char *)0x400500A6))
#define USB0_RXHUBPORT4_R       (*((volatile unsigned char *)0x400500A7))
#define USB0_TXFUNCADDR5_R      (*((volatile unsigned char *)0x400500A8))
#define USB0_TXHUBADDR5_R       (*((volatile unsigned char *)0x400500AA))
#define USB0_TXHUBPORT5_R       (*((volatile unsigned char *)0x400500AB))
#define USB0_RXFUNCADDR5_R      (*((volatile unsigned char *)0x400500AC))
#define USB0_RXHUBADDR5_R       (*((volatile unsigned char *)0x400500AE))
#define USB0_RXHUBPORT5_R       (*((volatile unsigned char *)0x400500AF))
#define USB0_TXFUNCADDR6_R      (*((volatile unsigned char *)0x400500B0))
#define USB0_TXHUBADDR6_R       (*((volatile unsigned char *)0x400500B2))
#define USB0_TXHUBPORT6_R       (*((volatile unsigned char *)0x400500B3))
#define USB0_RXFUNCADDR6_R      (*((volatile unsigned char *)0x400500B4))
#define USB0_RXHUBADDR6_R       (*((volatile unsigned char *)0x400500B6))
#define USB0_RXHUBPORT6_R       (*((volatile unsigned char *)0x400500B7))
#define USB0_TXFUNCADDR7_R      (*((volatile unsigned char *)0x400500B8))
#define USB0_TXHUBADDR7_R       (*((volatile unsigned char *)0x400500BA))
#define USB0_TXHUBPORT7_R       (*((volatile unsigned char *)0x400500BB))
#define USB0_RXFUNCADDR7_R      (*((volatile unsigned char *)0x400500BC))
#define USB0_RXHUBADDR7_R       (*((volatile unsigned char *)0x400500BE))
#define USB0_RXHUBPORT7_R       (*((volatile unsigned char *)0x400500BF))
#define USB0_TXFUNCADDR8_R      (*((volatile unsigned char *)0x400500C0))
#define USB0_TXHUBADDR8_R       (*((volatile unsigned char *)0x400500C2))
#define USB0_TXHUBPORT8_R       (*((volatile unsigned char *)0x400500C3))
#define USB0_RXFUNCADDR8_R      (*((volatile unsigned char *)0x400500C4))
#define USB0_RXHUBADDR8_R       (*((volatile unsigned char *)0x400500C6))
#define USB0_RXHUBPORT8_R       (*((volatile unsigned char *)0x400500C7))
#define USB0_TXFUNCADDR9_R      (*((volatile unsigned char *)0x400500C8))
#define USB0_TXHUBADDR9_R       (*((volatile unsigned char *)0x400500CA))
#define USB0_TXHUBPORT9_R       (*((volatile unsigned char *)0x400500CB))
#define USB0_RXFUNCADDR9_R      (*((volatile unsigned char *)0x400500CC))
#define USB0_RXHUBADDR9_R       (*((volatile unsigned char *)0x400500CE))
#define USB0_RXHUBPORT9_R       (*((volatile unsigned char *)0x400500CF))
#define USB0_TXFUNCADDR10_R     (*((volatile unsigned char *)0x400500D0))
#define USB0_TXHUBADDR10_R      (*((volatile unsigned char *)0x400500D2))
#define USB0_TXHUBPORT10_R      (*((volatile unsigned char *)0x400500D3))
#define USB0_RXFUNCADDR10_R     (*((volatile unsigned char *)0x400500D4))
#define USB0_RXHUBADDR10_R      (*((volatile unsigned char *)0x400500D6))
#define USB0_RXHUBPORT10_R      (*((volatile unsigned char *)0x400500D7))
#define USB0_TXFUNCADDR11_R     (*((volatile unsigned char *)0x400500D8))
#define USB0_TXHUBADDR11_R      (*((volatile unsigned char *)0x400500DA))
#define USB0_TXHUBPORT11_R      (*((volatile unsigned char *)0x400500DB))
#define USB0_RXFUNCADDR11_R     (*((volatile unsigned char *)0x400500DC))
#define USB0_RXHUBADDR11_R      (*((volatile unsigned char *)0x400500DE))
#define USB0_RXHUBPORT11_R      (*((volatile unsigned char *)0x400500DF))
#define USB0_TXFUNCADDR12_R     (*((volatile unsigned char *)0x400500E0))
#define USB0_TXHUBADDR12_R      (*((volatile unsigned char *)0x400500E2))
#define USB0_TXHUBPORT12_R      (*((volatile unsigned char *)0x400500E3))
#define USB0_RXFUNCADDR12_R     (*((volatile unsigned char *)0x400500E4))
#define USB0_RXHUBADDR12_R      (*((volatile unsigned char *)0x400500E6))
#define USB0_RXHUBPORT12_R      (*((volatile unsigned char *)0x400500E7))
#define USB0_TXFUNCADDR13_R     (*((volatile unsigned char *)0x400500E8))
#define USB0_TXHUBADDR13_R      (*((volatile unsigned char *)0x400500EA))
#define USB0_TXHUBPORT13_R      (*((volatile unsigned char *)0x400500EB))
#define USB0_RXFUNCADDR13_R     (*((volatile unsigned char *)0x400500EC))
#define USB0_RXHUBADDR13_R      (*((volatile unsigned char *)0x400500EE))
#define USB0_RXHUBPORT13_R      (*((volatile unsigned char *)0x400500EF))
#define USB0_TXFUNCADDR14_R     (*((volatile unsigned char *)0x400500F0))
#define USB0_TXHUBADDR14_R      (*((volatile unsigned char *)0x400500F2))
#define USB0_TXHUBPORT14_R      (*((volatile unsigned char *)0x400500F3))
#define USB0_RXFUNCADDR14_R     (*((volatile unsigned char *)0x400500F4))
#define USB0_RXHUBADDR14_R      (*((volatile unsigned char *)0x400500F6))
#define USB0_RXHUBPORT14_R      (*((volatile unsigned char *)0x400500F7))
#define USB0_TXFUNCADDR15_R     (*((volatile unsigned char *)0x400500F8))
#define USB0_TXHUBADDR15_R      (*((volatile unsigned char *)0x400500FA))
#define USB0_TXHUBPORT15_R      (*((volatile unsigned char *)0x400500FB))
#define USB0_RXFUNCADDR15_R     (*((volatile unsigned char *)0x400500FC))
#define USB0_RXHUBADDR15_R      (*((volatile unsigned char *)0x400500FE))
#define USB0_RXHUBPORT15_R      (*((volatile unsigned char *)0x400500FF))
#define USB0_CSRL0_R            (*((volatile unsigned char *)0x40050102))
#define USB0_CSRH0_R            (*((volatile unsigned char *)0x40050103))
#define USB0_COUNT0_R           (*((volatile unsigned char *)0x40050108))
#define USB0_TYPE0_R            (*((volatile unsigned char *)0x4005010A))
#define USB0_NAKLMT_R           (*((volatile unsigned char *)0x4005010B))
#define USB0_TXMAXP1_R          (*((volatile unsigned short *)0x40050110))
#define USB0_TXCSRL1_R          (*((volatile unsigned char *)0x40050112))
#define USB0_TXCSRH1_R          (*((volatile unsigned char *)0x40050113))
#define USB0_RXMAXP1_R          (*((volatile unsigned short *)0x40050114))
#define USB0_RXCSRL1_R          (*((volatile unsigned char *)0x40050116))
#define USB0_RXCSRH1_R          (*((volatile unsigned char *)0x40050117))
#define USB0_RXCOUNT1_R         (*((volatile unsigned short *)0x40050118))
#define USB0_TXTYPE1_R          (*((volatile unsigned char *)0x4005011A))
#define USB0_TXINTERVAL1_R      (*((volatile unsigned char *)0x4005011B))
#define USB0_RXTYPE1_R          (*((volatile unsigned char *)0x4005011C))
#define USB0_RXINTERVAL1_R      (*((volatile unsigned char *)0x4005011D))
#define USB0_TXMAXP2_R          (*((volatile unsigned short *)0x40050120))
#define USB0_TXCSRL2_R          (*((volatile unsigned char *)0x40050122))
#define USB0_TXCSRH2_R          (*((volatile unsigned char *)0x40050123))
#define USB0_RXMAXP2_R          (*((volatile unsigned short *)0x40050124))
#define USB0_RXCSRL2_R          (*((volatile unsigned char *)0x40050126))
#define USB0_RXCSRH2_R          (*((volatile unsigned char *)0x40050127))
#define USB0_RXCOUNT2_R         (*((volatile unsigned short *)0x40050128))
#define USB0_TXTYPE2_R          (*((volatile unsigned char *)0x4005012A))
#define USB0_TXINTERVAL2_R      (*((volatile unsigned char *)0x4005012B))
#define USB0_RXTYPE2_R          (*((volatile unsigned char *)0x4005012C))
#define USB0_RXINTERVAL2_R      (*((volatile unsigned char *)0x4005012D))
#define USB0_TXMAXP3_R          (*((volatile unsigned short *)0x40050130))
#define USB0_TXCSRL3_R          (*((volatile unsigned char *)0x40050132))
#define USB0_TXCSRH3_R          (*((volatile unsigned char *)0x40050133))
#define USB0_RXMAXP3_R          (*((volatile unsigned short *)0x40050134))
#define USB0_RXCSRL3_R          (*((volatile unsigned char *)0x40050136))
#define USB0_RXCSRH3_R          (*((volatile unsigned char *)0x40050137))
#define USB0_RXCOUNT3_R         (*((volatile unsigned short *)0x40050138))
#define USB0_TXTYPE3_R          (*((volatile unsigned char *)0x4005013A))
#define USB0_TXINTERVAL3_R      (*((volatile unsigned char *)0x4005013B))
#define USB0_RXTYPE3_R          (*((volatile unsigned char *)0x4005013C))
#define USB0_RXINTERVAL3_R      (*((volatile unsigned char *)0x4005013D))
#define USB0_TXMAXP4_R          (*((volatile unsigned short *)0x40050140))
#define USB0_TXCSRL4_R          (*((volatile unsigned char *)0x40050142))
#define USB0_TXCSRH4_R          (*((volatile unsigned char *)0x40050143))
#define USB0_RXMAXP4_R          (*((volatile unsigned short *)0x40050144))
#define USB0_RXCSRL4_R          (*((volatile unsigned char *)0x40050146))
#define USB0_RXCSRH4_R          (*((volatile unsigned char *)0x40050147))
#define USB0_RXCOUNT4_R         (*((volatile unsigned short *)0x40050148))
#define USB0_TXTYPE4_R          (*((volatile unsigned char *)0x4005014A))
#define USB0_TXINTERVAL4_R      (*((volatile unsigned char *)0x4005014B))
#define USB0_RXTYPE4_R          (*((volatile unsigned char *)0x4005014C))
#define USB0_RXINTERVAL4_R      (*((volatile unsigned char *)0x4005014D))
#define USB0_TXMAXP5_R          (*((volatile unsigned short *)0x40050150))
#define USB0_TXCSRL5_R          (*((volatile unsigned char *)0x40050152))
#define USB0_TXCSRH5_R          (*((volatile unsigned char *)0x40050153))
#define USB0_RXMAXP5_R          (*((volatile unsigned short *)0x40050154))
#define USB0_RXCSRL5_R          (*((volatile unsigned char *)0x40050156))
#define USB0_RXCSRH5_R          (*((volatile unsigned char *)0x40050157))
#define USB0_RXCOUNT5_R         (*((volatile unsigned short *)0x40050158))
#define USB0_TXTYPE5_R          (*((volatile unsigned char *)0x4005015A))
#define USB0_TXINTERVAL5_R      (*((volatile unsigned char *)0x4005015B))
#define USB0_RXTYPE5_R          (*((volatile unsigned char *)0x4005015C))
#define USB0_RXINTERVAL5_R      (*((volatile unsigned char *)0x4005015D))
#define USB0_TXMAXP6_R          (*((volatile unsigned short *)0x40050160))
#define USB0_TXCSRL6_R          (*((volatile unsigned char *)0x40050162))
#define USB0_TXCSRH6_R          (*((volatile unsigned char *)0x40050163))
#define USB0_RXMAXP6_R          (*((volatile unsigned short *)0x40050164))
#define USB0_RXCSRL6_R          (*((volatile unsigned char *)0x40050166))
#define USB0_RXCSRH6_R          (*((volatile unsigned char *)0x40050167))
#define USB0_RXCOUNT6_R         (*((volatile unsigned short *)0x40050168))
#define USB0_TXTYPE6_R          (*((volatile unsigned char *)0x4005016A))
#define USB0_TXINTERVAL6_R      (*((volatile unsigned char *)0x4005016B))
#define USB0_RXTYPE6_R          (*((volatile unsigned char *)0x4005016C))
#define USB0_RXINTERVAL6_R      (*((volatile unsigned char *)0x4005016D))
#define USB0_TXMAXP7_R          (*((volatile unsigned short *)0x40050170))
#define USB0_TXCSRL7_R          (*((volatile unsigned char *)0x40050172))
#define USB0_TXCSRH7_R          (*((volatile unsigned char *)0x40050173))
#define USB0_RXMAXP7_R          (*((volatile unsigned short *)0x40050174))
#define USB0_RXCSRL7_R          (*((volatile unsigned char *)0x40050176))
#define USB0_RXCSRH7_R          (*((volatile unsigned char *)0x40050177))
#define USB0_RXCOUNT7_R         (*((volatile unsigned short *)0x40050178))
#define USB0_TXTYPE7_R          (*((volatile unsigned char *)0x4005017A))
#define USB0_TXINTERVAL7_R      (*((volatile unsigned char *)0x4005017B))
#define USB0_RXTYPE7_R          (*((volatile unsigned char *)0x4005017C))
#define USB0_RXINTERVAL7_R      (*((volatile unsigned char *)0x4005017D))
#define USB0_TXMAXP8_R          (*((volatile unsigned short *)0x40050180))
#define USB0_TXCSRL8_R          (*((volatile unsigned char *)0x40050182))
#define USB0_TXCSRH8_R          (*((volatile unsigned char *)0x40050183))
#define USB0_RXMAXP8_R          (*((volatile unsigned short *)0x40050184))
#define USB0_RXCSRL8_R          (*((volatile unsigned char *)0x40050186))
#define USB0_RXCSRH8_R          (*((volatile unsigned char *)0x40050187))
#define USB0_RXCOUNT8_R         (*((volatile unsigned short *)0x40050188))
#define USB0_TXTYPE8_R          (*((volatile unsigned char *)0x4005018A))
#define USB0_TXINTERVAL8_R      (*((volatile unsigned char *)0x4005018B))
#define USB0_RXTYPE8_R          (*((volatile unsigned char *)0x4005018C))
#define USB0_RXINTERVAL8_R      (*((volatile unsigned char *)0x4005018D))
#define USB0_TXMAXP9_R          (*((volatile unsigned short *)0x40050190))
#define USB0_TXCSRL9_R          (*((volatile unsigned char *)0x40050192))
#define USB0_TXCSRH9_R          (*((volatile unsigned char *)0x40050193))
#define USB0_RXMAXP9_R          (*((volatile unsigned short *)0x40050194))
#define USB0_RXCSRL9_R          (*((volatile unsigned char *)0x40050196))
#define USB0_RXCSRH9_R          (*((volatile unsigned char *)0x40050197))
#define USB0_RXCOUNT9_R         (*((volatile unsigned short *)0x40050198))
#define USB0_TXTYPE9_R          (*((volatile unsigned char *)0x4005019A))
#define USB0_TXINTERVAL9_R      (*((volatile unsigned char *)0x4005019B))
#define USB0_RXTYPE9_R          (*((volatile unsigned char *)0x4005019C))
#define USB0_RXINTERVAL9_R      (*((volatile unsigned char *)0x4005019D))
#define USB0_TXMAXP10_R         (*((volatile unsigned short *)0x400501A0))
#define USB0_TXCSRL10_R         (*((volatile unsigned char *)0x400501A2))
#define USB0_TXCSRH10_R         (*((volatile unsigned char *)0x400501A3))
#define USB0_RXMAXP10_R         (*((volatile unsigned short *)0x400501A4))
#define USB0_RXCSRL10_R         (*((volatile unsigned char *)0x400501A6))
#define USB0_RXCSRH10_R         (*((volatile unsigned char *)0x400501A7))
#define USB0_RXCOUNT10_R        (*((volatile unsigned short *)0x400501A8))
#define USB0_TXTYPE10_R         (*((volatile unsigned char *)0x400501AA))
#define USB0_TXINTERVAL10_R     (*((volatile unsigned char *)0x400501AB))
#define USB0_RXTYPE10_R         (*((volatile unsigned char *)0x400501AC))
#define USB0_RXINTERVAL10_R     (*((volatile unsigned char *)0x400501AD))
#define USB0_TXMAXP11_R         (*((volatile unsigned short *)0x400501B0))
#define USB0_TXCSRL11_R         (*((volatile unsigned char *)0x400501B2))
#define USB0_TXCSRH11_R         (*((volatile unsigned char *)0x400501B3))
#define USB0_RXMAXP11_R         (*((volatile unsigned short *)0x400501B4))
#define USB0_RXCSRL11_R         (*((volatile unsigned char *)0x400501B6))
#define USB0_RXCSRH11_R         (*((volatile unsigned char *)0x400501B7))
#define USB0_RXCOUNT11_R        (*((volatile unsigned short *)0x400501B8))
#define USB0_TXTYPE11_R         (*((volatile unsigned char *)0x400501BA))
#define USB0_TXINTERVAL11_R     (*((volatile unsigned char *)0x400501BB))
#define USB0_RXTYPE11_R         (*((volatile unsigned char *)0x400501BC))
#define USB0_RXINTERVAL11_R     (*((volatile unsigned char *)0x400501BD))
#define USB0_TXMAXP12_R         (*((volatile unsigned short *)0x400501C0))
#define USB0_TXCSRL12_R         (*((volatile unsigned char *)0x400501C2))
#define USB0_TXCSRH12_R         (*((volatile unsigned char *)0x400501C3))
#define USB0_RXMAXP12_R         (*((volatile unsigned short *)0x400501C4))
#define USB0_RXCSRL12_R         (*((volatile unsigned char *)0x400501C6))
#define USB0_RXCSRH12_R         (*((volatile unsigned char *)0x400501C7))
#define USB0_RXCOUNT12_R        (*((volatile unsigned short *)0x400501C8))
#define USB0_TXTYPE12_R         (*((volatile unsigned char *)0x400501CA))
#define USB0_TXINTERVAL12_R     (*((volatile unsigned char *)0x400501CB))
#define USB0_RXTYPE12_R         (*((volatile unsigned char *)0x400501CC))
#define USB0_RXINTERVAL12_R     (*((volatile unsigned char *)0x400501CD))
#define USB0_TXMAXP13_R         (*((volatile unsigned short *)0x400501D0))
#define USB0_TXCSRL13_R         (*((volatile unsigned char *)0x400501D2))
#define USB0_TXCSRH13_R         (*((volatile unsigned char *)0x400501D3))
#define USB0_RXMAXP13_R         (*((volatile unsigned short *)0x400501D4))
#define USB0_RXCSRL13_R         (*((volatile unsigned char *)0x400501D6))
#define USB0_RXCSRH13_R         (*((volatile unsigned char *)0x400501D7))
#define USB0_RXCOUNT13_R        (*((volatile unsigned short *)0x400501D8))
#define USB0_TXTYPE13_R         (*((volatile unsigned char *)0x400501DA))
#define USB0_TXINTERVAL13_R     (*((volatile unsigned char *)0x400501DB))
#define USB0_RXTYPE13_R         (*((volatile unsigned char *)0x400501DC))
#define USB0_RXINTERVAL13_R     (*((volatile unsigned char *)0x400501DD))
#define USB0_TXMAXP14_R         (*((volatile unsigned short *)0x400501E0))
#define USB0_TXCSRL14_R         (*((volatile unsigned char *)0x400501E2))
#define USB0_TXCSRH14_R         (*((volatile unsigned char *)0x400501E3))
#define USB0_RXMAXP14_R         (*((volatile unsigned short *)0x400501E4))
#define USB0_RXCSRL14_R         (*((volatile unsigned char *)0x400501E6))
#define USB0_RXCSRH14_R         (*((volatile unsigned char *)0x400501E7))
#define USB0_RXCOUNT14_R        (*((volatile unsigned short *)0x400501E8))
#define USB0_TXTYPE14_R         (*((volatile unsigned char *)0x400501EA))
#define USB0_TXINTERVAL14_R     (*((volatile unsigned char *)0x400501EB))
#define USB0_RXTYPE14_R         (*((volatile unsigned char *)0x400501EC))
#define USB0_RXINTERVAL14_R     (*((volatile unsigned char *)0x400501ED))
#define USB0_TXMAXP15_R         (*((volatile unsigned short *)0x400501F0))
#define USB0_TXCSRL15_R         (*((volatile unsigned char *)0x400501F2))
#define USB0_TXCSRH15_R         (*((volatile unsigned char *)0x400501F3))
#define USB0_RXMAXP15_R         (*((volatile unsigned short *)0x400501F4))
#define USB0_RXCSRL15_R         (*((volatile unsigned char *)0x400501F6))
#define USB0_RXCSRH15_R         (*((volatile unsigned char *)0x400501F7))
#define USB0_RXCOUNT15_R        (*((volatile unsigned short *)0x400501F8))
#define USB0_TXTYPE15_R         (*((volatile unsigned char *)0x400501FA))
#define USB0_TXINTERVAL15_R     (*((volatile unsigned char *)0x400501FB))
#define USB0_RXTYPE15_R         (*((volatile unsigned char *)0x400501FC))
#define USB0_RXINTERVAL15_R     (*((volatile unsigned char *)0x400501FD))
#define USB0_RQPKTCOUNT1_R      (*((volatile unsigned short *)0x40050304))
#define USB0_RQPKTCOUNT2_R      (*((volatile unsigned short *)0x40050308))
#define USB0_RQPKTCOUNT3_R      (*((volatile unsigned short *)0x4005030C))
#define USB0_RQPKTCOUNT4_R      (*((volatile unsigned short *)0x40050310))
#define USB0_RQPKTCOUNT5_R      (*((volatile unsigned short *)0x40050314))
#define USB0_RQPKTCOUNT6_R      (*((volatile unsigned short *)0x40050318))
#define USB0_RQPKTCOUNT7_R      (*((volatile unsigned short *)0x4005031C))
#define USB0_RQPKTCOUNT8_R      (*((volatile unsigned short *)0x40050320))
#define USB0_RQPKTCOUNT9_R      (*((volatile unsigned short *)0x40050324))
#define USB0_RQPKTCOUNT10_R     (*((volatile unsigned short *)0x40050328))
#define USB0_RQPKTCOUNT11_R     (*((volatile unsigned short *)0x4005032C))
#define USB0_RQPKTCOUNT12_R     (*((volatile unsigned short *)0x40050330))
#define USB0_RQPKTCOUNT13_R     (*((volatile unsigned short *)0x40050334))
#define USB0_RQPKTCOUNT14_R     (*((volatile unsigned short *)0x40050338))
#define USB0_RQPKTCOUNT15_R     (*((volatile unsigned short *)0x4005033C))
#define USB0_RXDPKTBUFDIS_R     (*((volatile unsigned short *)0x40050340))
#define USB0_TXDPKTBUFDIS_R     (*((volatile unsigned short *)0x40050342))
